SanketHiremath/Lightweight-RTOS-TM4C123/main.c
// RTOS Framework - Fall 2022
// J Losh

// Student Name:Sanket Shashikant Hiremath
// TO DO: Add your name(s) on this line.
//        Do not include your ID number(s) in the file.

// Please do not change any function name in this code or the thread priorities

//-----------------------------------------------------------------------------
// Hardware Target
//-----------------------------------------------------------------------------

// Target Platform: EK-TM4C123GXL Evaluation Board
// Target uC:       TM4C123GH6PM
// System Clock:    40 MHz

// Hardware configuration:
// 6 Pushbuttons and 5 LEDs, UART
// LEDs on these pins:
// Blue:   PF2 (on-board)
// Red:    PE0 (lengthy and general)
// Orange: PA2 (idle)
// Yellow: PA3 (oneshot and general)
// Green:  PA4 (flash4hz)
// PBs on these pins
// PB0:    PD6 (set red, toggle yellow)
// PB1:    PD7 (clear red, post flash_request semaphore)
// PB2:    PC4 (restart flash4hz)
// PB3:    PC5 (stop flash4hz, uncoop)
// PB4:    PC6 (lengthy priority increase)
// PB5:    PC7 (errant)
// UART Interface:
//   U0TX (PA1) and U0RX (PA0) are connected to the 2nd controller
//   The USB on the 2nd controller enumerates to an ICDI interface and a virtual COM port
//   Configured to 115,200 baud, 8N1
// Memory Protection Unit (MPU):
//   Region to allow peripheral access (RW) or a general all memory access (RW)
//   Region to allow flash access (XRW)
//   Regions to allow 32 1KiB SRAM access (RW or none)

//-----------------------------------------------------------------------------
// Device includes, defines, and assembler directives
//-----------------------------------------------------------------------------

#include <stdint.h>
#include <stdbool.h>
#include "tm4c123gh6pm.h"
#include "clock.h"
#include "gpio.h"
#include "uart0.h"
#include "wait.h"
// TODO: Add header files here for your strings functions, ...
#include "shell.h"

#define BLUE_LED   PORTF,2 // on-board blue LED
#define RED_LED    PORTE,0 // off-board red LED
#define ORANGE_LED PORTA,2 // off-board orange LED
#define YELLOW_LED PORTA,3 // off-board yellow LED
#define GREEN_LED  PORTA,4 // off-board green LED

#define PUSH_BUTTON1 PORTD,6
#define PUSH_BUTTON2 PORTD,7
#define PUSH_BUTTON3 PORTC,4
#define PUSH_BUTTON4 PORTC,5
#define PUSH_BUTTON5 PORTC,6
#define PUSH_BUTTON6 PORTC,7

// Region numbers
#define REGION0         0x00
#define REGION1         0x01
#define REGION2         0x02
#define REGION3         0x03
#define REGION4         0x04
#define REGION5         0x05
#define REGION6         0x06

// SRAM regions
#define SRAM_REGION_BASE0       0x20000000
#define SRAM_REGION_BASE1       0x20002000
#define SRAM_REGION_BASE2       0x20004000
#define SRAM_REGION_BASE3       0x20006000

// SRAM sub-regions mask
#define DISABLE_ALL_SUBREGIONS  0xFF00

// Region size masks
#define REGION_SIZE(x)      (x<<1)
#define SIZE_8KB            0x0C
#define SIZE_4GB            0x1F

// Access control masks
#define AP_NO_ACCESS           (0 << 24)
#define AP_RW_PRIVILEGED_ONLY  (1 << 24)
#define AP_RW_RO_UNPRIVILEGED  (2 << 24)
#define AP_FULL_ACCESS         (3 << 24)
#define AP_RO_PRIVILEGED       (5 << 24)

extern void enablePSPMode();
extern void  setPSP(uint32_t address);
extern uint32_t* getPsp();
extern uint32_t* getMsp();
extern void disablePrivileged();
extern void pushStack();
extern void popStack();
extern void pushPsp(uint32_t r0);

typedef enum svcNum
{ YIELD   = 10,
  SLEEP   = 11,
  WAIT    = 12,
  POST    = 13,
  MALLOC  = 14,
  REBOOT  = 15,
  SCHED   = 16,
  PREEMPT = 17,
  SETDATA    = 18
}svcNumber;

//-----------------------------------------------------------------------------
// RTOS Defines and Kernel Variables
//-----------------------------------------------------------------------------

// function pointer
typedef void (*_fn)();

// semaphore
#define MAX_SEMAPHORES 5
#define MAX_QUEUE_SIZE 5
typedef struct _semaphore
{
    uint16_t count;
    uint16_t queueSize;
    uint32_t processQueue[MAX_QUEUE_SIZE]; // store task index here
} semaphore;

semaphore semaphores[MAX_SEMAPHORES];
#define keyPressed 1
#define keyReleased 2
#define flashReq 3
#define resource 4

// task
#define STATE_INVALID    0 // no task
#define STATE_UNRUN      1 // task has never been run
#define STATE_READY      2 // has run, can resume at any time
#define STATE_DELAYED    3 // has run, but now awaiting timer
#define STATE_BLOCKED    4 // has run, but now blocked by semaphore

#define MAX_TASKS   12       // maximum number of valid tasks
#define ROUND_ROBIN 0
#define PRIORITY    1
uint8_t activeScheduler = ROUND_ROBIN;
uint8_t preemptionMode = 0;
uint8_t taskCurrent = 0;   // index of last dispatched task
uint8_t taskCount = 0;     // total number of valid tasks
static uint32_t task_point;
static uint32_t prevSrdBits = 0;

struct _semaphoreData
{
    char semaphoreName[12];
    uint16_t semaphoreCount;
    uint16_t waitingTaskNumber;
    uint32_t waitQueue[5];

};

typedef struct _semaphoreData semaphoreInfo;


// REQUIRED: add store and management for the memory used by the thread stacks
//           thread stacks must start on 1 kiB boundaries so mpu can work correctly

struct _tcb
{
    uint8_t state;                 // see STATE_ values above
    void *pid;                     // used to uniquely identify thread
    void *spInit;                  // original top of stack
    void *sp;                      // current stack pointer
    int8_t priority;               // 0=highest to 7=lowest
    uint32_t ticks;                // ticks until sleep complete
    uint32_t srd;                  // MPU subregion disable bits (one per 1 KiB)
    char name[16];                 // name of task used in ps command
    void *semaphore;               // pointer to the semaphore that is blocking the thread
} tcb[MAX_TASKS];


//-----------------------------------------------------------------------------
// Memory Manager and MPU Funcitons
//-----------------------------------------------------------------------------

