SanketHiremath/Lightweight-RTOS-TM4C123/main.c
// TODO: add your malloc code here and update the SRD bits for the current thread
void * mallocFromHeap(uint32_t size_in_bytes)
{

//    static void *heap = 0x20001800;
    uint32_t num;
    static uint32_t prevAddr =  0x20001800;;

//    prevAddr =(uint32_t) heap;
    num = (((size_in_bytes - 1) / 1024) + 1);
//    heap += num;
    prevAddr = (prevAddr + (num * 1024));

    return (void*)prevAddr;
}

// REQUIRED: add your MPU functions here

void sramSubregionToggle(uint8_t regionNum, uint8_t mask)
{

    NVIC_MPU_NUMBER_R = regionNum;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(SIZE_8KB) | NVIC_MPU_ATTR_CACHEABLE | NVIC_MPU_ATTR_SHAREABLE | AP_RW_PRIVILEGED_ONLY ;
    NVIC_MPU_ATTR_R |=  ((uint32_t)mask << 8);
}

void setSRAMBits(uint32_t bit_mask)
{
    uint8_t mask0, mask1, mask2, mask3;

    mask0 = (bit_mask &  0x000000FF);          // Mask for the sram block 0
    mask1 = (bit_mask &  0x0000FF00) >> 8;     // Mask for the sram block 1
    mask2 = (bit_mask &  0x00FF0000) >> 16;    // Mask for the sram block 2
    mask3 = (bit_mask &  0xFF000000) >> 24;    // Mask for the sram block 3

    // writing the mask for the different sub-regions to the MPU ATRR register
    sramSubregionToggle(REGION3, mask0);            // Writing the SRD bits mask to the region 3 of SRAM.
    sramSubregionToggle(REGION4, mask1);            // Writing the SRD bits mask to the region 4 of SRAM.
    sramSubregionToggle(REGION5, mask2);            // Writing the SRD bits mask to the region 5 of SRAM.
    sramSubregionToggle(REGION6, mask3);            // Writing the SRD bits mask to the region 6 of SRAM.


}

void enableExceptionHandler(void)
{
    NVIC_SYS_HND_CTRL_R |= NVIC_SYS_HND_CTRL_USAGE;
    NVIC_SYS_HND_CTRL_R |= NVIC_SYS_HND_CTRL_BUS;
    NVIC_SYS_HND_CTRL_R |= NVIC_SYS_HND_CTRL_MEM;
}

// Turns ON the MPU
void enableMPU(void)
{
    NVIC_MPU_CTRL_R |= NVIC_MPU_CTRL_ENABLE;
//    NVIC_MPU_CTRL_R |= NVIC_MPU_CTRL_HFNMIENA;
}

void setBackgroundRule(void)
{

    NVIC_MPU_BASE_R = REGION0 | NVIC_MPU_BASE_VALID | 0x00000000;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(SIZE_4GB) | NVIC_MPU_ATTR_BUFFRABLE | NVIC_MPU_ATTR_CACHEABLE | NVIC_MPU_ATTR_SHAREABLE | AP_FULL_ACCESS;
}

void allowFlashAccess(void)
{
    NVIC_MPU_BASE_R = REGION1 | NVIC_MPU_BASE_VALID | 0x00000000;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(0x11) | NVIC_MPU_ATTR_CACHEABLE | AP_FULL_ACCESS;
}

//Not used as peripherals are covered by the background rule.
void allowPeripheralAccess(void)
{
    NVIC_MPU_BASE_R = REGION2 | NVIC_MPU_BASE_VALID | 0x4000000;

}

void setupSramAccess(void)
{
    // SRAM 8KiB block 0
    NVIC_MPU_BASE_R = REGION3 | NVIC_MPU_BASE_VALID | SRAM_REGION_BASE0;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(SIZE_8KB) | NVIC_MPU_ATTR_CACHEABLE | NVIC_MPU_ATTR_SHAREABLE | AP_RW_PRIVILEGED_ONLY;

    // SRAM 8KiB block 1
    NVIC_MPU_BASE_R = REGION4 | NVIC_MPU_BASE_VALID | SRAM_REGION_BASE1;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(SIZE_8KB) | NVIC_MPU_ATTR_CACHEABLE | NVIC_MPU_ATTR_SHAREABLE | AP_RW_PRIVILEGED_ONLY;

    // SRAM 8KiB block 2
    NVIC_MPU_BASE_R = REGION5 | NVIC_MPU_BASE_VALID | SRAM_REGION_BASE2;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(SIZE_8KB) | NVIC_MPU_ATTR_CACHEABLE | NVIC_MPU_ATTR_SHAREABLE | AP_RW_PRIVILEGED_ONLY;

    // SRAM 8KiB block 3
    NVIC_MPU_BASE_R = REGION6 | NVIC_MPU_BASE_VALID | SRAM_REGION_BASE3;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(SIZE_8KB) | NVIC_MPU_ATTR_CACHEABLE | NVIC_MPU_ATTR_SHAREABLE | AP_RW_PRIVILEGED_ONLY;

}

uint8_t getSvcNumber()
{
    uint32_t* psp = getPsp();
    uint8_t N = *(uint16_t*)(*(psp + 6) - 2) & 0xFF;

    return N;
}

// REQUIRED: initialize MPU here
void initMpu(void)
{
    // REQUIRED: call your MPU functions here
    enableExceptionHandler();                               // Enable all exception handling
    setBackgroundRule();                                    // Setting background rule for entire memory map.
    allowFlashAccess();                                     // Setting background rule for 256KiB flash.
    setupSramAccess();                                      // Dividing SRAM into 4 regions & setting access rules.
    enableMPU();
}

void copyString(const char* fromStr, char* toStr)
{
    uint8_t i = 0;

    for(i = 0; fromStr[i] != '\0' && i < 16; i++)
    {
        toStr[i] = fromStr[i];
    }

    toStr[i] = '\0';
}

void getIpcsData(struct _semaphoreData* semaphoreFrame)
{
    uint8_t i,j;
/*
    putsUart0("SemaphoreName |");
    putsUart0(" Count |");
    putsUart0(" Who's-waiting? \n\r");

    for(i = 0; i < MAX_SEMAPHORES; i++)
    {
        convertNumToString(semaphores[i].count);
        putsUart0("   ");
        convertNumToString(semaphores[i].queueSize);
        putsUart0("   ");
        for( j = 0; j < MAX_QUEUE_SIZE; j++)
        {
            convertNumToString(semaphores[i].processQueue[j]);
            putsUart0("\n\r");
        }

    }
*/

    for(i = 0; i < MAX_SEMAPHORES; i++)
    {
        semaphoreFrame[i].semaphoreCount = semaphores[i].count;
        semaphoreFrame[i].waitingTaskNumber = semaphores[i].queueSize;
        uint8_t j = 0;
        for(; j < semaphores[i].queueSize; j++)
            semaphoreFrame[i].waitQueue[j] = semaphores[i].processQueue[j];
    }



    copyString("null\0", semaphoreFrame[0].semaphoreName);
    copyString("keyPressed\0", semaphoreFrame[1].semaphoreName);
    copyString("keyReleased\0", semaphoreFrame[2].semaphoreName);
    copyString("flashReq\0", semaphoreFrame[3].semaphoreName);
    copyString("resource\0", semaphoreFrame[4].semaphoreName);

}

//-----------------------------------------------------------------------------
// RTOS Kernel Functions
//-----------------------------------------------------------------------------

// REQUIRED: initialize systick for 1ms system timer
void initRtos()
{
    uint8_t i;
    // no tasks running
    taskCount = 0;
    // clear out tcb records
    for (i = 0; i < MAX_TASKS; i++)
    {
        tcb[i].state = STATE_INVALID;
        tcb[i].pid = 0;
    }
}

// REQUIRED: Implement prioritization to 8 levels
int rtosScheduler()
{
    bool ok;
    static uint8_t task = 0xFF;
    ok = false;
    while (!ok)
    {
        task++;
        if (task >= MAX_TASKS)
            task = 0;
        ok = (tcb[task].state == STATE_READY || tcb[task].state == STATE_UNRUN);
    }
    return task;
}

bool createThread(_fn fn, const char name[], uint8_t priority, uint32_t stackBytes)
{
    uint8_t num;
    uint32_t subregionNum, bitMask;
    uint32_t* heap = (uint32_t*)0x20001400;
    uint32_t addr;
    uint32_t* tempAddr;
//    static uint32_t prevSrdBits = 0;
//    uint32_t* brk = (uint32_t*)0x20007FFF;

    bool ok = false;
    uint8_t i = 0;
    bool found = false;
    // REQUIRED:
    // store the thread name
    copyString(name, tcb[i].name);
    // allocate stack space and store top of stack in sp and spInit

