SanketHiremath/Lightweight-RTOS-TM4C123/main.c
    // add task if room in task list
    if (taskCount < MAX_TASKS)
    {
        // make sure fn not already in list (prevent reentrancy)
        while (!found && (i < MAX_TASKS))
        {
            found = (tcb[i++].pid ==  fn);
        }
        if (!found)
        {
            num = (((stackBytes - 1) / 1024) + 1);

            // find first available tcb record
            i = 0;
            while (tcb[i].state != STATE_INVALID) {i++;}
            tcb[i].state = STATE_UNRUN;
            tcb[i].pid = fn;


             if (i == 0)
             {
                addr = (uint32_t)heap;
             }
             else
             {
                addr = (uint32_t)tcb[i-1].spInit;
                tempAddr = mallocFromHeap(1023);
                putsUart0("malloc= ");
                convertDec_Hex((uint32_t) tempAddr);
                putsUart0("\n\r");
             }


            tcb[i].sp = (void*)(addr + (num * 1024)-1);
            tcb[i].spInit = (void*)(addr + (num * 1024)-1);

            // Calculating the SRD bits
            subregionNum = ((uint32_t)(tcb[i].spInit) - (0x20000000)) / 1024;  // Calculate no. of times to shift
            stackBytes = stackBytes / 1024;               // Calculate no. of bits to flip
            bitMask = (1 << stackBytes) - 1;              // Calculate the number of SRD bits to be high
            bitMask = (bitMask << subregionNum);          // Moving the bits to the correct subregion.
//            prevSrdBits = prevSrdBits | bitMask;          // New bitmask is ORed with the previous bitmask.


            putsUart0("spinit= ");
            convertDec_Hex((uint32_t) tcb[i].spInit);
            putsUart0("\n\r");

            tcb[i].priority = priority;
            tcb[i].srd = (bitMask);

//            convertDec_Hex((uint32_t) tcb[i].srd);
//            putsUart0("\n\r");
            // increment task count
            taskCount++;
            ok = true;
        }
    }
    // REQUIRED: allow tasks switches again
    return ok;
}

// REQUIRED: modify this function to restart a thread
void restartThread(_fn fn)
{
}

// REQUIRED: modify this function to stop a thread
// REQUIRED: remove any pending semaphore waiting
// NOTE: see notes in class for strategies on whether stack is freed or not
void stopThread(_fn fn)
{
}

// REQUIRED: modify this function to set a thread priority
void setThreadPriority(_fn fn, uint8_t priority)
{
}

bool createSemaphore(uint8_t semaphore, uint8_t count)
{
    bool ok = (semaphore < MAX_SEMAPHORES);
    {
        semaphores[semaphore].count = count;
    }
    return ok;
}

// REQUIRED: modify this function to start the operating system
// by calling scheduler, setting PSP, ASP bit, TMPL bit, and PC
void startRtos()
{
    // Calling the RTOS scheduler to get the current task running.
    taskCurrent = (uint8_t)rtosScheduler();

    // Setting the stack pointer to the stack space of the process
    // and setting the ASP bit.
    setPSP((uint32_t)tcb[taskCurrent].sp);
    enablePSPMode();

    // Setting the process id of the current task to the function pointer.
    _fn fn = (_fn)tcb[taskCurrent].pid;
    tcb[taskCurrent].state = STATE_READY;


//    setSRAMBits(0xFFFFFFFF);
    prevSrdBits = prevSrdBits | tcb[taskCurrent].srd;
    setSRAMBits(prevSrdBits);
//    convertDec_Hex((uint32_t) tcb[taskCurrent].srd);
//    putsUart0("\n\r");

    // Turning on the TMPL bit and calling the function
    disablePrivileged();
    fn();
}

// REQUIRED: modify this function to yield execution back to scheduler using pendsv
void yield()
{
//    putcUart0('y');
    __asm(" SVC  #10");

}

// REQUIRED: modify this function to support 1ms system timer
// execution yielded back to scheduler until time elapses using pendsv
void sleep(uint32_t tick)
{
    __asm(" SVC  #11");
}

// REQUIRED: modify this function to wait a semaphore using pendsv
void wait(int8_t semaphore)
{
    __asm(" SVC  #12");
}

// REQUIRED: modify this function to signal a semaphore is available using pendsv
void post(int8_t semaphore)
{
    __asm(" SVC  #13");
}

// REQUIRED: modify this function to add support for the system timer
// REQUIRED: in preemptive code, add code to request task switch
void systickIsr()
{
    uint8_t i;

    for(i = 0; i <= taskCount; i++)
    {
        if (tcb[i].state == STATE_DELAYED)
        {
            if (tcb[i].ticks == 0)
            {
                tcb[i].state = STATE_READY;
            }
            tcb[i].ticks--;
        }
    }

}

// REQUIRED: in coop and preemptive, modify this function to add support for task switching
// REQUIRED: process UNRUN and READY tasks differently
void pendSvIsr()
{
/*
    putcUart0('p');

    pushStack();
    tcb[taskCurrent].sp = (void*)getPsp();
    // calling the scheduler
    taskCurrent = (uint8_t)rtosScheduler();
    tcb[taskCurrent].state = STATE_READY;
    setSRAMBits(tcb[taskCurrent].srd);
    setPSP((uint32_t)tcb[taskCurrent].sp);
    popStack();
*/

    pushStack();
    tcb[taskCurrent].sp = (void*)getPsp();
    taskCurrent = (uint8_t)rtosScheduler();



   prevSrdBits = prevSrdBits | tcb[taskCurrent].srd;
   setSRAMBits(prevSrdBits);
//   setSRAMBits(0xFFFFFFFF);  // currently giving access to the entire SRAM

    if(tcb[taskCurrent].state == STATE_READY)
    {
        setPSP((uint32_t)tcb[taskCurrent].sp);  // Put into PSP the task current to switch task
        popStack();                             // Pop R4 - R11
    }

    else
    {
        tcb[taskCurrent].state = STATE_READY;
        setPSP((uint32_t)tcb[taskCurrent].spInit);  // Point the sp to the sp of the task
        pushPsp(0x61000000);                        // xPSR
        pushPsp((uint32_t)tcb[taskCurrent].pid);    // PC
        pushPsp(0xFFFFFFFD);                        // LR
        pushPsp(0x00);                              // R12
        pushPsp(0x00);                              // R3
        pushPsp(0x00);                              // R2
        pushPsp(0x00);                              // R1
        pushPsp(0x00);                              // R0
    }


