SanketHiremath/Lightweight-RTOS-TM4C123/main.c
}

// REQUIRED: modify this function to add support for the service call
// REQUIRED: in preemptive code, add code to handle synchronization primitives
void svCallIsr()
{
    uint8_t i = 0;
    uint8_t num;
    uint8_t currentTaskInQueue;
    uint32_t sizeInBytes;
    uint32_t subregionNum, bitMask, stackBytes;
    uint32_t* psp;
    uint32_t prevAddr;
    uint32_t* stack = (uint32_t*)0x20006000;
    uint32_t srd;
    uint32_t type;


    psp = getPsp();
//    num = getSvcNumber();
    num = *(uint16_t*)(*(psp + 6) - 2) & 0xFF;

    switch(num)
    {
    case YIELD:
        NVIC_INT_CTRL_R |= NVIC_INT_CTRL_PEND_SV;       // Call the pendsv ISR
        break;

    case SLEEP:
        tcb[taskCurrent].ticks = *psp;
        tcb[taskCurrent].state = STATE_DELAYED;
        NVIC_INT_CTRL_R |= NVIC_INT_CTRL_PEND_SV;       // Call the pendsv ISR
        break;

    case WAIT:
        if(semaphores[*psp].count > 0)
        {
            semaphores[*psp].count--;
        }
        else
        {
            if(semaphores[*psp].queueSize < MAX_QUEUE_SIZE)
            {
                semaphores[*psp].processQueue[semaphores[*psp].queueSize++] = taskCurrent;
                tcb[taskCurrent].semaphore = (void*)(semaphores + *psp);
                tcb[taskCurrent].state = STATE_BLOCKED;
                NVIC_INT_CTRL_R |= NVIC_INT_CTRL_PEND_SV;
            }
        }
        break;

    case POST:
        semaphores[*psp].count++;       // Increment the count for the selected semaphore

        if(semaphores[*psp].count >= 1 && semaphores[*psp].queueSize > 0)
        {
            currentTaskInQueue = semaphores[*psp].processQueue[0];
            semaphores[*psp].count--;
            tcb[currentTaskInQueue].state = STATE_READY;
            for(i = 0; i < semaphores[*psp].queueSize - 1; i++)
            {
                semaphores[*psp].processQueue[i] = semaphores[*psp].processQueue[i + 1];
            }
            semaphores[*psp].queueSize--;
        }
        break;

    case MALLOC:
        sizeInBytes = *psp;     //Get the size stored in the R0 register
        prevAddr = (uint32_t)stack;
        num = (((sizeInBytes - 1) / 1024) + 1);

        prevAddr = (prevAddr + (num * 1024)-1);


        subregionNum = ((uint32_t)prevAddr - (0x20000000)) / 1024;  // Calculate no. of times to shift
        sizeInBytes = sizeInBytes / 1024;               // Calculate no. of bits to flip
        bitMask = (1 << sizeInBytes) - 1;              // Calculate the number of SRD bits to be high
        bitMask = (bitMask << subregionNum);          // Moving the bits to the correct subregion.

        prevSrdBits = prevSrdBits | bitMask;
        setSRAMBits(prevSrdBits);

        *psp = (uint32_t)prevAddr;

        break;

    case REBOOT:
        NVIC_APINT_R = (0x05FA0000 | NVIC_APINT_SYSRESETREQ);
        break;

    case SCHED:
        if((bool)(*psp) == 1)
        {
            activeScheduler = PRIORITY;
            putsUart0("sched prio\n\r");
            putsUart0("\r\n>");
        }
        else
        {
            activeScheduler = ROUND_ROBIN;
            putsUart0("sched rr\n\r");
            putsUart0("\r\n>");
        }
        break;

    case PREEMPT:
        if((bool)(*psp) == 1)
        {
            preemptionMode = 1;
            putsUart0("preempt on\n\r");
            putsUart0("\r\n>");
        }
        else
        {
            preemptionMode = 0;
            putsUart0("preempt off\n\r");
            putsUart0("\r\n>");

        }
        break;

    case SETDATA:
    {
        struct _semaphoreData* arguments = (struct _semaphoreData*)*psp;
        type = (*(psp + 1));

        if (type == 1)
        {
            getIpcsData(arguments);
        }

    }
    break;


    }
}

// REQUIRED: code this function
void mpuFaultIsr()
{
    uint32_t* address1;
    uint32_t* address2;

    putsUart0("MPU fault occured\n\r");


    // Print MSP and PSP
    putsUart0("MSP = 0x");
    address1 = getMsp();
    convertDec_Hex((uint32_t)address1);
    putsUart0("\r\n");

    putsUart0("PSP = 0x");
    address2 = getPsp();
    convertDec_Hex((uint32_t)address2);
    putsUart0("\r\n");

    putsUart0("mFault Flags = 0x");
    convertDec_Hex(NVIC_FAULT_STAT_R & 0xFF);
    putsUart0("\r\n");


    // Printing the reg r0-r3, r12...
     uint32_t *stackdump;
     stackdump = getPsp();

    putsUart0("R0 = 0x");
    convertDec_Hex(*(stackdump));
    putsUart0("\r\n");

    putsUart0("R1 = 0x");
    convertDec_Hex(*(stackdump + 1));
    putsUart0("\r\n");

    putsUart0("R2 = 0x");
    convertDec_Hex(*(stackdump + 2));
    putsUart0("\r\n");

    putsUart0("R3 = 0x");
    convertDec_Hex(*(stackdump + 3));
    putsUart0("\r\n");

    putsUart0("R12 = 0x");
    convertDec_Hex(*(stackdump + 4));
    putsUart0("\r\n");

    putsUart0("LR = 0x");
    convertDec_Hex(*(stackdump + 5));
    putsUart0("\r\n");

    putsUart0("PC = 0x");
    convertDec_Hex(*(stackdump + 6));
    putsUart0("\r\n");

    putsUart0("xPSR = 0x");
    convertDec_Hex(*(stackdump + 7));
    putsUart0("\r\n");
    putsUart0("-------------------------------------------------------\n\r");

    // Clearing the MPU fault
    NVIC_SYS_HND_CTRL_R &= ~NVIC_SYS_HND_CTRL_MEMP;

    // Triggering a PendSV ISR
    NVIC_INT_CTRL_R |= NVIC_INT_CTRL_PEND_SV;
}

// REQUIRED: code this function
void hardFaultIsr()
{
    uint32_t* address1;
    uint32_t* address2;
    uint32_t test2;

    putsUart0("hard fault occured\n\r");

    // Print MSP and PSP
    putsUart0("MSP = 0x");
    address1 = getMsp();
    convertDec_Hex((uint32_t)address1);
    putsUart0("\r\n");

    putsUart0("PSP = 0x");
    address2 = getPsp();
    convertDec_Hex((uint32_t)address2);
    putsUart0("\r\n");

    putsUart0("Hard Fault Flags = 0x");
    test2 = (NVIC_HFAULT_STAT_R & 0xFF);
    convertDec_Hex(test2);

    putsUart0("\r\n");
    putsUart0("-------------------------------------------------------\n\r");
}

// REQUIRED: code this function
void busFaultIsr()
{
    putsUart0("bus fault occured\n\r");
    putsUart0("-------------------------------------------------------\n\r");
}

// REQUIRED: code this function
void usageFaultIsr()
{
    putsUart0("usage fault occured\n\r");
    putsUart0("-------------------------------------------------------\n\r");
}

