SanketHiremath/Lightweight-RTOS-TM4C123/main.c
//-----------------------------------------------------------------------------
// Subroutines
//-----------------------------------------------------------------------------

// Initialize Hardware
// REQUIRED: Add initialization for blue, orange, red, green, and yellow LEDs
//           6 pushbuttons
void initHw()
{
    // Initialize system clock to 40 MHz
    initSystemClockTo40Mhz();

    // Enable clocks
    enablePort(PORTA);
    enablePort(PORTC);
    enablePort(PORTD);
    enablePort(PORTE);
    enablePort(PORTF);

    // Configure LED pins
    selectPinPushPullOutput(BLUE_LED);
    selectPinPushPullOutput(ORANGE_LED);
    selectPinPushPullOutput(RED_LED);
    selectPinPushPullOutput(GREEN_LED);
    selectPinPushPullOutput(YELLOW_LED);

    // Configure push button pins
    selectPinDigitalInput(PUSH_BUTTON1);
    enablePinPullup(PUSH_BUTTON1);
    selectPinDigitalInput(PUSH_BUTTON2);
    enablePinPullup(PUSH_BUTTON2);
    selectPinDigitalInput(PUSH_BUTTON3);
    enablePinPullup(PUSH_BUTTON3);
    selectPinDigitalInput(PUSH_BUTTON4);
    enablePinPullup(PUSH_BUTTON4);
    selectPinDigitalInput(PUSH_BUTTON5);
    enablePinPullup(PUSH_BUTTON5);
    selectPinDigitalInput(PUSH_BUTTON6);
    enablePinPullup(PUSH_BUTTON6);

    //Initialise the systick timer
    NVIC_ST_CTRL_R |= NVIC_ST_CTRL_CLK_SRC | NVIC_ST_CTRL_INTEN | NVIC_ST_CTRL_ENABLE;
    NVIC_ST_RELOAD_R = (0x9C3F) & (0x00FFFFFF);


}

// REQUIRED: add code to return a value from 0-63 indicating which of 6 PBs are pressed
uint8_t readPbs()
{
    uint8_t value;

    if(getPinValue(PUSH_BUTTON1)==0)
    {
        value = 1;
    }

    if(getPinValue(PUSH_BUTTON2)==0)
    {
        value = 2;
    }

    if(getPinValue(PUSH_BUTTON3)==0)
    {
        value = 4;
    }

    if(getPinValue(PUSH_BUTTON4)==0)
    {
        value = 8;
    }

    if(getPinValue(PUSH_BUTTON5)==0)
    {
        value = 16;
    }

    if(getPinValue(PUSH_BUTTON6)==0)
    {
        value = 32;
    }

    return value;
}

//-----------------------------------------------------------------------------
// YOUR UNIQUE CODE
// REQUIRED: add any custom code in this space
//-----------------------------------------------------------------------------
void idle2()
{
    while(true)
    {
        setPinValue(RED_LED, 1);
        waitMicrosecond(1000);
        setPinValue(RED_LED, 0);
        yield();
    }
}

int8_t priNextTask[MAX_TASKS];
uint8_t level = 0;

void sortTaskPriorities()
{
    for(level = 0; level < MAX_TASKS; level++)
        priNextTask[level] = -1;
    level = 0;
    int8_t priority = 0;
    uint8_t j = 0;
    // The max priority level is 7
    for(priority = 0; priority <= 7; priority++)
        for(j = 0; j < taskCount && j < MAX_TASKS; j++)
            if(tcb[j].priority == priority)
                priNextTask[level++] = j;
    level = 0;
}

int priorityScheduler()
{
    bool ok = false;
    while(!ok)
    {
        if(level >= taskCount)
            level = 0;
        ok = (tcb[priNextTask[level]].state == STATE_READY || tcb[priNextTask[level]].state == STATE_UNRUN);
        level++;
    }
    return priNextTask[level - 1];
}

void* mallocFromHeap_UserSpace(uint32_t size_in_bytes)
{
    __asm(" SVC  #14");
}



// ------------------------------------------------------------------------------
//  Task functions
// ------------------------------------------------------------------------------

// one task must be ready at all times or the scheduler will fail
// the idle task is implemented for this purpose
void idle()
{
    while(true)
    {
        setPinValue(ORANGE_LED, 1);
        waitMicrosecond(1000);
        setPinValue(ORANGE_LED, 0);
        yield();
    }
}

void flash4Hz()
{
    while(true)
    {
        setPinValue(GREEN_LED, !getPinValue(GREEN_LED));
        sleep(125);
    }
}

void oneshot()
{
    while(true)
    {
        wait(flashReq);
        setPinValue(YELLOW_LED, 1);
        sleep(1000);
        setPinValue(YELLOW_LED, 0);
    }
}

void partOfLengthyFn()
{
    // represent some lengthy operation
    waitMicrosecond(990);
    // give another process a chance to run
    yield();
}

void lengthyFn()
{
    uint16_t i;
    uint8_t *p;

    // Example of allocating memory from stack
    // This will show up in the pmap command for this thread
    p = mallocFromHeap_UserSpace(1024);
    *p = 0;

    while(true)
    {
        wait(resource);
        for (i = 0; i < 5000; i++)
        {
            partOfLengthyFn();
        }
        setPinValue(RED_LED, !getPinValue(RED_LED));
        post(resource);
    }
}

void readKeys()
{
    uint8_t buttons;
    while(true)
    {
        wait(keyReleased);
        buttons = 0;
        while (buttons == 0)
        {
            buttons = readPbs();
            yield();
        }
        post(keyPressed);
        if ((buttons & 1) != 0)
        {
            setPinValue(YELLOW_LED, !getPinValue(YELLOW_LED));
            setPinValue(RED_LED, 1);
        }
        if ((buttons & 2) != 0)
        {
            post(flashReq);
            setPinValue(RED_LED, 0);
        }
        if ((buttons & 4) != 0)
        {
            restartThread(flash4Hz);
        }
        if ((buttons & 8) != 0)
        {
            stopThread(flash4Hz);
        }
        if ((buttons & 16) != 0)
        {
            setThreadPriority(lengthyFn, 4);
        }
        yield();
    }
}

void debounce()
{
    uint8_t count;
    while(true)
    {
        wait(keyPressed);
        count = 10;
        while (count != 0)
        {
            sleep(10);
            if (readPbs() == 0)
                count--;
            else
                count = 10;
        }
        post(keyReleased);
    }
}

void uncooperative()
{
    while(true)
    {
        while (readPbs() == 8)
        {
        }
        yield();
    }
}

void errant()
{
    uint32_t* p = (uint32_t*)0x20000000;
    while(true)
    {
        while (readPbs() == 32)
        {
            *p = 0;
        }
        yield();
    }
}

void important()
{
    while(true)
    {
        wait(resource);
        setPinValue(BLUE_LED, 1);
        sleep(1000);
        setPinValue(BLUE_LED, 0);
        post(resource);
    }
}

// REQUIRED: add processing for the shell commands through the UART here

void getData(semaphoreInfo* semDataForm,uint32_t type)
{
   __asm(" SVC  #18");
}

