SanketHiremath/Lightweight-RTOS-TM4C123/main.c
/*
void ipcs(semaphoreInfo* semDataForm)
{
    putsUart0("\r\n>");
    __asm(" SVC  #18");
}
*/

void shell()
{
  inputData data;
  uint32_t* ipcsData;


    putsUart0("\r\n>");

    while (true)
    {
        getString(&data);

        if (matchCommand(&data, "kill", 1))
        {
            int32_t testNum = getNum(&data);
//            kill(testNum);
        }
        else if (matchCommand(&data, "reboot", 0))
        {
            rebootMCU();
        }
        else if (matchCommand(&data, "ps", 0))
        {
//            ps();
        }
        else if (matchCommand(&data, "ipcs", 0))
        {
            uint8_t i, j;
            semaphoreInfo semDataForm[5];
//            ipcs(semDataForm);
            putsUart0("Semaphore Name");
            putsUart0(" Count");
            putsUart0(" Who's waiting? \n\r");
            getData(semDataForm, 1);

            i = 0;
            for(; i < 5; i++)
            {
                printfString(14, semDataForm[i].semaphoreName);
                convertNumToString(semDataForm[i].semaphoreCount);
                j = 0;
                for(; j < semDataForm[i].waitingTaskNumber; j++)
                    convertNumToString(semDataForm[i].waitQueue[j]);
                putcUart0('\n');
            }


        }
        else if (matchCommand(&data, "kill", 1))
        {

            if (matchCommandArg(&data, "pid"))
            {
//                kill(1);

            }
        }
        else if (matchCommand(&data, "pmap", 1))
        {
            if (matchCommandArg(&data, "pid"))
            {
//                pmap(1);

            }
        }
        else if (matchCommand(&data, "preempt", 1))
        {
            if (matchCommandArg(&data, "on"))
            {
                preempt(1);

            }
            else if (matchCommandArg(&data, "off"))
            {
                preempt(0);

            }
        }
        else if (matchCommand(&data, "sched", 1))
        {
            if (matchCommandArg(&data, "prio"))
            {
                sched(1);
            }
            else if (matchCommandArg(&data, "rr"))
            {
                sched(0);

            }
        }
        else if (matchCommand(&data, "pidof", 1))
        {
            if (matchCommandArg(&data, "proc_name"))
            {
//                pidof("test");
            }
        }
        else if (matchCommand(&data, "run", 1))
        {
            if (matchCommandArg(&data, "proc_name"))
            {
                setPinValue(RED_LED, 1);
            }
        }
    }
}

//-----------------------------------------------------------------------------
// Main
//-----------------------------------------------------------------------------

int main(void)
{
    bool ok;

    // Initialize hardware
    initHw();

    initUart0();
    initMpu();
    initRtos();

    // Setup UART0 baud rate
    setUart0BaudRate(115200, 40e6);

    // Power-up flash
    setPinValue(GREEN_LED, 1);
    waitMicrosecond(250000);
    setPinValue(GREEN_LED, 0);
    waitMicrosecond(250000);

    // Initialize semaphores
    createSemaphore(keyPressed, 1);
    createSemaphore(keyReleased, 0);
    createSemaphore(flashReq, 5);
    createSemaphore(resource, 1);

    // Add required idle process at lowest priority
    ok =  createThread(idle, "Idle", 7, 1024);
//    ok &=  createThread(idle2, "Idle2", 7, 1024);

    // Add other processes
    ok &= createThread(lengthyFn, "LengthyFn", 6, 1024);
    ok &= createThread(flash4Hz, "Flash4Hz", 4, 1024);
    ok &= createThread(oneshot, "OneShot", 2, 1024);
    ok &= createThread(readKeys, "ReadKeys", 6, 1024);
    ok &= createThread(debounce, "Debounce", 6, 1024);
    ok &= createThread(important, "Important", 0, 1024);
    ok &= createThread(uncooperative, "Uncoop", 6, 1024);
    ok &= createThread(errant, "Errant", 6, 1024);
    ok &= createThread(shell, "Shell", 6, 2048);

    // Start up RTOS
    if (ok)
        startRtos(); // never returns
    else
        setPinValue(RED_LED, 1);

    return 0;
}
